/***********************************************************************
 * @file     boss.cpp
 * @brief
 * @author   blacegg
 * @version  1.0
 * @date     2023-09-07
 ***********************************************************************/
#include "boss.h"

/***********************************************************************
 * @brief    Construct a new boss::boss object
 * @param    id:
 * @param    name:
 * @param    dId:
 ***********************************************************************/
Boss::Boss(int id, string name, int dId)
{
    this->m_Id = id;
    this->m_Name = name;
    this->m_DeptId = dId;
}

/***********************************************************************
 * @brief    boss::showInfo
 ***********************************************************************/
void Boss::showInfo()
{
    cout << "职工编号： " << this->m_Id
         << " \t职工姓名： " << this->m_Name
         << " \t岗位：" << this->getDeptName()
         << " \t岗位职责：管理公司所有事务" << endl;
}

/***********************************************************************
 * @brief    boss::getDeptName
 * @return   string:
 ***********************************************************************/
string Boss::getDeptName()
{
    return string("老板");
}
